index.org
# -*- mode: org; -*-

#+TITLE:     EASY TALK
#+AUTHOR:    0F04
#+DESCRIPTION: THINGS I WANNA TALK ABOUT
#+LANGUAGE:  en
#+OPTIONS:   H:4 toc:t num:2


#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>


* Kernel
** Hiding a kernel malicious module.


* Documentation efforts.
* The time I almost got training.
** Day 0
*** Introduction and reason:

    This is a learning preparedness series for my journey to infiltrate2018 for 
    "master track: kernel exploitation".  As work could neither justify my
    attendence or give time off for me to go, this is for perhaps someone elses 
    assistance.

    Here I will break down any resources and clarify my understanding in my own
    words to ensure that I document my understanding and that I am not wasting time
    and money.

    I want to build practical examples that I can read and reference at a later
    date.

    I've broken down the data from https://infiltratecon.com/schedule/ into the
    days that information is being presented, I want to do research into each of
    the topics and make this as fruitful as possible.

*** Day 0 (Background information)
