index.org
**** How the stack works

      Draw from:
      http://badbytes.io/2017/02/15/exploit-dev-0x01-64-bit-linux-stack-buffer-overflow/
    
p**** Understanding a kernel stack trace.

      When you get a backtrace you may see something similar to the below:

     #+BEGIN_EXAMPLE
     [  509.617661] BUG: unable to handle kernel NULL pointer dereference at 0000000000000028

                     [<ffffffffc0599a80>] drbg_kcapi_reset+0x160/0x220 [drbg] 
     [  509.642461]  [<ffffffff812eb867>] rngapi_reset+0x57/0x80
     [  509.642461]  [<ffffffffc05c400f>] rng_setkey+0xf/0x20 [algif_rng]
     [  509.642461]  [<ffffffff812ec131>] alg_setsockopt+0x101/0x140
     [  509.642461]  [<ffffffff8156b3a0>] SyS_setsockopt+0x80/0xf0
     [  509.642461]  [<ffffffff816b4fc9>] system_call_fastpath+0x16/0x1b
   
   
     [  509.642461] RAX: 0000000000000010 RBX: ffff8800b37a3c00 RCX: 000000000000000a
     [  509.642461] RAX: 0000000000000010 RBX: ffff8800b37a3c00 RCX: 000000000000000a
     [  509.642461] RDX: 000000000000000a RSI: ffffffffc059b6f6 RDI: ffffffffc059dae2
     [  509.642461] RBP: ffff880137847ea8 R08: 0000000000000036 R09: 0000000000000000
     [  509.642461] R10: ffff88013fc19ba0 R11: ffffea00022ac900 R12: ffffffffc059dae2
     [  509.642461] R13: 000000000000000b R14: ffffffffc059b6f6 R15: 000000000000000a
     #+END_EXAMPLE                

     Kernel stack traces read "bottom up", the most recently executing function is
     at the top, followed by the function that called that, followed by the function
     that called and so on.

     To break down a single line:

     #+BEGIN_EXAMPLE
     Each line explained:

                     [<ffffffffc0599a80>] drbg_kcapi_reset+0x160/0x220 [drbg] 
                      ^1                  ^2               ^3    ^4    ^5
     #+END_EXAMPLE

     Below, each element is explained:

     1) Physical location of memory where this is being run, should be kernel address space.
     2) Name of the function that the kernel "thinks" its in.
     3) Offset from the start of the function that the 'unwinder' could match.
     4) Length of the function that the 'unwinder' could match to.
     5) Optional, kernel module name.
   
     From the above we can see that the kernel paniced while in drbg_kcapi_reset at
     offset 0x160 through the function..  We're going to show a method in this case
     to confirm that the stack trace is working how we assume it is.

     Examples within are in the intel assembly format because that is what I feel
     more comfortable with.

     Lets start by using objdump on the module to see the assembly instruction that
     the kernel paniced on:
   
     #+BEGIN_EXAMPLE
   
        $ objdump -dSLR -M intel drbg.ko |grep drbg_kcapi_reset | grep -A 25 
   
        static int drbg_kcapi_reset(struct crypto_rng *tfm, u8 *seed, unsigned int slen)
   
        0000000000002920 
   
         2a5d:       41 83 ff 0b             cmp    r15d,0xb
         2a61:       75 dd                   jne    2a40 <drbg_kcapi_reset+0x120>
         2a63:       45 30 ff                xor    r15b,r15b
         2a66:       8b 45 98                mov    eax,DWORD PTR [rbp-0x68]
         2a69:       85 c0                   test   eax,eax
         2a6b:       0f 85 97 00 00 00       jne    2b08 <drbg_kcapi_reset+0x1e8>
         2a71:       48 83 7d a0 00          cmp    QWORD PTR [rbp-0x60],0x0
         2a76:       0f 84 a4 00 00 00       je     2b20 <drbg_kcapi_reset+0x200>
         2a7c:       48 8b 45 a0             mov    rax,QWORD PTR [rbp-0x60]
         2a80:       4c 8b 60 18             mov    r12,QWORD PTR [rax+0x18] <<== HERE
         2a84:       4d 85 e4                test   r12,r12                  
         2a87:       74 22                   je     2aab <drbg_kcapi_reset+0x18b>
         2a89:       49 83 3c 24 00          cmp    QWORD PTR [r12],0x0
         2a8e:       74 1b                   je     2aab <drbg_kcapi_reset+0x18b>
         2a90:       4c 8b 75 a8             mov    r14,QWORD PTR [rbp-0x58]
   
     #+END_EXAMPLE
   
     So to find the instruction it bugged on: 
   
     #+BEGIN_EXAMPLE
       0x2920 (function offset) 
     + 0x0160 (instruction offset)
     ========
       0x2a80
     ========
     #+END_EXAMPLE
   
     We can see that this bugged on mov r12,QWORD PTR[rax+0x18]. This kind of
     instruction is usually used when looking up elements of a struct.
   
     We do notice however that the backtrace mentions 0x28, but the assembly
     instruction mentions 0x10, what gives.. well thats because the RAX 
     register contains 0x10 (See stack dump above).  RAX + 0x18, added together 
     giveth 0x28.
   
     Timesaver:
   
     If you ever need to do hex math you can use python 
   
     #+BEGIN_EXAMPLE
     python
     >> hex (0x2920 + 0x160)
     0x2a80
     >> hex (0x18 + 0x1000)
     0x28
     #+END_EXAMPLE
   
     Fortunately, we have the source code, so we can use the previous in
     confirm what line was being bugged.

     The addr2line or "eu-addr2line" tool is able to translate the function+offset
     into a line number.   You may need to use your kernels "debug" modules or
     "debuginfo" modules to correctly determine the offset information as not all
     modules will have sufficient debugging symbols present to determine which line
     is being executed.  
   
     Shown below is the RHEL7 drbg.ko module from kernel-debuginfo.  It is important
     to run this against the matching kernel release or the line values will not
     match correctly.
   
   
     #+BEGIN_EXAMPLE
     [wmealing@linux Downloads]$  eu-addr2line -f -e  ./usr/lib/debug/lib/modules/3.10.0-691.el7.x86_64/kernel/crypto/drbg.ko.debug 
     drbg_kcapi_reset+0x160
     drbg_kcapi_reset
     crypto/drbg.c:1741
   
     #+END_EXAMPLE
   
     We get a little closer, so lets take a look at that line:
   
     #+BEGIN_EXAMPLE
        1722 static int drbg_kcapi_reset(struct crypto_rng *tfm, u8 *seed, unsigned int slen)
        1723 {
        1724         struct drbg_state *drbg = crypto_rng_ctx(tfm);
        1725         struct crypto_tfm *tfm_base = crypto_rng_tfm(tfm);
        1726         bool pr = false;
        1727         struct drbg_string seed_string;
        1728         int coreref = 0;
        1729 
        1730         drbg_uninstantiate(drbg);
        1731         drbg_convert_tfm_core(crypto_tfm_alg_driver_name(tfm_base), &coreref,
        1732                               &pr);
        1733         if (0 < slen) {
        1734                 drbg_string_fill(&seed_string, seed, slen);
        1735                 return drbg_instantiate(drbg, &seed_string, coreref, pr);
        1736         } else {
        1737                 struct drbg_gen *data = (struct drbg_gen *)seed;
        1738                 /* allow invocation of API call with NULL, 0 */
        1739                 if (!data)
        1740                         return drbg_instantiate(drbg, NULL, coreref, pr);
        1741                 drbg_set_testdata(drbg, data->test_data); <-- HERE
        1742                 /* linked list variable is now local to allow modification */
        1743                 drbg_string_fill(&seed_string, data->addtl->buf,
        1744                                  data->addtl->len);
        1745                 return drbg_instantiate(drbg, &seed_string, coreref, pr);
        1746         }
        1747 }
     #+END_EXAMPLE
      
     Because we can see that its trying to find the offset of a specific item (with
     rax+0x18 in the instruction) we can take a pretty good guess that its looking
     at data->test_data.
   
     The drbg_set_testdata function is an "inline" function.  This means that the
     kernel function will not include the usual "call" assembly instruction to
     execute the function, but instead will put the code that the function would
     execute directly in-place.
   
     Because of this, We can match the first instruction of the drbg_set_testdata
     function with the next instruction of the dissasembly.
   
     This first instruction is a testing that the first arguent is "not null", this
     is acheived in assembly with the "test" instruction.  
   
     #+NAME: Test instruction.
     #+BEGIN_EXAMPLE
     test r12 r12
     #+END_EXAMPLE

     We can backtrack to the previous instruction and determine that the result was
     stored in R12 to see if we are likely in the correc tlocation
   
     #+NAME: pointer-dereference instruction.
     #+BEGIN_EXAMPLE
      2a80:       4c 8b 60 18             mov    r12,QWORD PTR [rax+0x18]
     #+END_EXAMPLE

     References:
      https://stackoverflow.com/questions/6151538/addr2line-on-kernel-module

