index.org
**** Userland vs kernel land.
***** What is userspace:

    Userspace is an area of memory reserved for applications that run on behalf
    of users to execute.  It has a contiguous section of memory of a subsection of
    the full memory available

    mention pte... abstraction.
    virtual address space uses page tables to look things up.

    - syscalls explain context
    - ioctls explain context

***** What is a syscall?

      A system call, sometimes referred to as a kernel call, is a request in a
      Unix-like operating system made via a software interrupt by an active 
      process for a service performed by the kernel.

      Link to any POSIX spec for syscalls or doc on syscalls ?

***** What is an ioctl ?

      An ioctl (an abbreviation of input/output control) is a system call for 
      device-specific input/output operations and other operations which cannot be
      expressed by regular system calls.  Usually these control hardware.

      Link to any discussion on deprecation of ioctls to other mechanisms.

      #+BEGIN_EXAMPLE

      #include <fcntl.h>      /* open */ 
      #include <unistd.h>     /* exit */
      #include <sys/ioctl.h>  /* ioctl */

      #define DEVICE_FILE_NAME "/dev/something"
      #define IOCTL_GET_MSG 1

      /* Main - Call the ioctl functions */
      void main() {
           int fd;
           int ret_val;
           char *msg = "Message passed by ioctl\n";

           fd = open(DEVICE_FILE_NAME, 0);
           if (file_desc < 0) {

               printf ("Can't open device file: %s\n",  DEVICE_FILE_NAME);

               ret_val = ioctl(fd, IOCTL_GET_MSG, message);

               if (ret_val < 0)
                  printf("ioctl_get_msgfailed:%d\n",ret_val);

           }
      }
     

#+END_EXAMPLE

The expectation is that the hardware kernel would relay the expectation that
userspace has a request to fulfil and respond with the change or an error
message regarding why the request could not be completed.

***** What is sysfs/configfs ?

Link to source code of sysfs generics.

***** What is /dev/

***** What is Netlink messages ?

     - Limited subset of commands.
     - Examples provided by me will be done in kernel modules loaded at run time.

     - Find link to pedantism format required, but if you're doing evil best to
       just do it in whatever you're comfortable with.

     Netlink flaw:
     https://bugzilla.redhat.com/show_bug.cgi?id=CVE-2009-1185 

***** What is kernel space

   - No floating point work done in kernel, those registers get smashed.
   - no stdlibs from glibc.
   - can't use userspace libraries, code, read/write et

    Full address space of the system.  Not directly accessible from userspace.
    Syscalls, ioctls, sysfs have indirect access to the the kernel through through
    their proxy style mechanism.

    No "protection" provided from kernel->kernel access, can't limit execution of
    kernel code.

    Kernel proxies all memory access of applications via page tables, 

    Linux kernel process memory map
    https://www.kernel.org/doc/Documentation/x86/x86_64/mm.txt

** Day +1 (Preparation)
*** Setting up a kernel debugging environment
****  See example on this github.
     - https://gist.github.com/wmealing/24db20d60995a57ab5b8fc550378e54e 
     - Reproduca , pull down and put on github.
       
*** Kernel internals
**** Memory models and the address space
**** Device drivers

     Check makefile in driver directory

     obj-y lines are forced internals
     obj-($CONFIG_SOMETHING) depends on the CONFIG_SOMETHING being set in the
     kernels /usr/src/linux/.config 
*** Flaw types
**** Infoleak
     Reveals offsets and values of shit on stack.
**** Privesc
     Changing the running priv of the current program.

**** X86 calling conventions.
     Talk here about the stack what order of arguements in which bit 32/64 that 
     args are passed int he stack, probably link to wikipedia article here on
     the current x86 calling conventions, and maybe find the arm one too.
     
**** Key structures in privesc
***** Task struct
***** Thread info struct

*** Exploit stages
**** Was reading a book about the 4 stages of exploitation, cover that here.

***** Stage 1: Setup/Initialization
***** Stage 2: _______
***** Stage 3: Exploitation
***** Stage 4: Recovery / Cleanup ?


*** Common C Exploit types
     * Signedness issues
       https://en.wikibooks.org/wiki/X86_Assembly/Control_Flow#Jump_if_Above_.28unsigned_comparison.29
     * Integer overflow
     * Type promotion in comparison.
     * Overflowing into adjacent objects
     * Off-by-[one/X]
     * Use after free
     * Stack corruption
     * Heap Corruption
     * Information leak
       Used to generate offsets to find task_struct and set uid / gid to 0.
     * OOB accesss ?

*** Kernel Mitigations
 
    Describe each one of the kernel mitigatations.

**** Stack guard page.

**** SMEP

      Bypassing SMEP (Supervisor Mode Execution Protection)
      :- http://vulnfactory.org/blog/2011/06/05/smep-what-is-it-and-how-to-beat-it-on-linux/

**** SMAP
      - https://github.com/wmealing/playground/tree/master/kernel-module-disable-smep

        So, weird things, i think it gets re-enabled when copy_to_user happens
        (frequently), so maybe i need to work this into some kind of shellcode
        that can be injected during the payload.  

        The other option is that i need to continually run this by hooking it
        into the re-enable code to ensure that it never gets disabled

        LWN made a page on it https://lwn.net/Articles/517475/

**** Struct alignment.     
**** Hardening list ?
**** Seccomp sandboxing
