index.html

<div id="outline-container-org5486bdb" class="outline-5">
<h5 id="org5486bdb">Userland vs kernel land.</h5>
<div class="outline-text-5" id="text-org5486bdb">
</div>
<ul class="org-ul">
<li><a id="orgea511e7"></a>What is userspace:<br />
<div class="outline-text-6" id="text-orgea511e7">
<p>
Userspace is an area of memory reserved for applications that run on behalf
of users to execute.  It has a contiguous section of memory of a subsection of
the full memory available
</p>

<p>
mention pte&#x2026; abstraction.
virtual address space uses page tables to look things up.
</p>

<ul class="org-ul">
<li>syscalls explain context</li>
<li>ioctls explain context</li>
</ul>
</div>
</li>

<li><a id="orgca639b9"></a>What is a syscall?<br />
<div class="outline-text-6" id="text-orgca639b9">
<p>
A system call, sometimes referred to as a kernel call, is a request in a
Unix-like operating system made via a software interrupt by an active 
process for a service performed by the kernel.
</p>

<p>
Link to any POSIX spec for syscalls or doc on syscalls ?
</p>
</div>
</li>

<li><a id="orgbcea7b3"></a>What is an ioctl ?<br />
<div class="outline-text-6" id="text-orgbcea7b3">
<p>
An ioctl (an abbreviation of input/output control) is a system call for 
device-specific input/output operations and other operations which cannot be
expressed by regular system calls.  Usually these control hardware.
</p>

<p>
Link to any discussion on deprecation of ioctls to other mechanisms.
</p>

<pre class="example">

#include &lt;fcntl.h&gt;      /* open */ 
#include &lt;unistd.h&gt;     /* exit */
#include &lt;sys/ioctl.h&gt;  /* ioctl */

#define DEVICE_FILE_NAME "/dev/something"
#define IOCTL_GET_MSG 1

/* Main - Call the ioctl functions */
void main() {
     int fd;
     int ret_val;
     char *msg = "Message passed by ioctl\n";

     fd = open(DEVICE_FILE_NAME, 0);
     if (file_desc &lt; 0) {

         printf ("Can't open device file: %s\n",  DEVICE_FILE_NAME);

         ret_val = ioctl(fd, IOCTL_GET_MSG, message);

         if (ret_val &lt; 0)
            printf("ioctl_get_msgfailed:%d\n",ret_val);

     }
}


</pre>

<p>
The expectation is that the hardware kernel would relay the expectation that
userspace has a request to fulfil and respond with the change or an error
message regarding why the request could not be completed.
</p>
</div>
</li>

<li><a id="org6def92d"></a>What is sysfs/configfs ?<br />
<div class="outline-text-6" id="text-org6def92d">
<p>
Link to source code of sysfs generics.
</p>
</div>
</li>

<li><a id="orga643f43"></a>What is <i>dev</i><br /></li>

<li><a id="org7c44176"></a>What is Netlink messages ?<br />
<div class="outline-text-6" id="text-org7c44176">
<ul class="org-ul">
<li>Limited subset of commands.</li>
<li>Examples provided by me will be done in kernel modules loaded at run time.</li>

<li>Find link to pedantism format required, but if you're doing evil best to
just do it in whatever you're comfortable with.</li>
</ul>

<p>
Netlink flaw:
<a href="https://bugzilla.redhat.com/show_bug.cgi?id=CVE-2009-1185">https://bugzilla.redhat.com/show_bug.cgi?id=CVE-2009-1185</a> 
</p>
</div>
</li>

<li><a id="org08112a4"></a>What is kernel space<br />
<div class="outline-text-6" id="text-org08112a4">
<ul class="org-ul">
<li>No floating point work done in kernel, those registers get smashed.</li>
<li>no stdlibs from glibc.</li>
<li><p>
can't use userspace libraries, code, read/write et
</p>

<p>
Full address space of the system.  Not directly accessible from userspace.
Syscalls, ioctls, sysfs have indirect access to the the kernel through through
their proxy style mechanism.
</p>

<p>
No "protection" provided from kernel-&gt;kernel access, can't limit execution of
kernel code.
</p>

<p>
Kernel proxies all memory access of applications via page tables, 
</p>

<p>
Linux kernel process memory map
<a href="https://www.kernel.org/doc/Documentation/x86/x86_64/mm.txt">https://www.kernel.org/doc/Documentation/x86/x86_64/mm.txt</a>
</p></li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgec76a08" class="outline-3">
<h3 id="orgec76a08"><span class="section-number-3">2.2</span> Day +1 (Preparation)</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgc2764da" class="outline-4">
<h4 id="orgc2764da">Setting up a kernel debugging environment</h4>
<div class="outline-text-4" id="text-orgc2764da">
</div>
<div id="outline-container-org30b49c7" class="outline-5">
<h5 id="org30b49c7">My document on blogs.redhat.com</h5>
<div class="outline-text-5" id="text-org30b49c7">
<ul class="org-ul">
<li><a href="https://gist.github.com/wmealing/24db20d60995a57ab5b8fc550378e54e">https://gist.github.com/wmealing/24db20d60995a57ab5b8fc550378e54e</a></li>
<li>Reproduca , pull down and put on github.
<ul class="org-ul">
<li>Don't forget to show murray this tool.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge20710e" class="outline-4">
<h4 id="orge20710e">Kernel internals</h4>
<div class="outline-text-4" id="text-orge20710e">
</div>
<div id="outline-container-org5a660aa" class="outline-5">
<h5 id="org5a660aa">Memory models and the address space</h5>
</div>
</div>
<div id="outline-container-orgce42c7e" class="outline-4">
<h4 id="orgce42c7e">Flaw types</h4>
<div class="outline-text-4" id="text-orgce42c7e">
</div>
<div id="outline-container-org7c3b52a" class="outline-5">
<h5 id="org7c3b52a">Infoleak</h5>
<div class="outline-text-5" id="text-org7c3b52a">
<p>
Reveals offsets and values of shit on stack.
</p>
</div>
</div>
<div id="outline-container-org619bf9d" class="outline-5">
<h5 id="org619bf9d">Privesc</h5>
<div class="outline-text-5" id="text-org619bf9d">
<p>
Changing the running priv of the current program.
</p>
</div>
</div>

<div id="outline-container-orge81f27b" class="outline-5">
<h5 id="orge81f27b">X86 calling conventions.</h5>
</div>
<div id="outline-container-org4208ca9" class="outline-5">
<h5 id="org4208ca9">Key structures in privesc</h5>
<div class="outline-text-5" id="text-org4208ca9">
</div>
<ul class="org-ul">
<li><a id="org8f809e1"></a>Task struct<br /></li>
<li><a id="org5b6fefe"></a>Thread info struct<br />
<div class="outline-text-6" id="text-org5b6fefe">
<p>
From a process whats it look like
</p>
</div>
</li>
</ul>
</div>
</div>


<div id="outline-container-org4d48c66" class="outline-4">
<h4 id="org4d48c66">Exploit stages</h4>
<div class="outline-text-4" id="text-org4d48c66">
</div>
<div id="outline-container-org5b739a6" class="outline-5">
<h5 id="org5b739a6">Was reading a book about the 4 stages of exploitation, cover that here.</h5>
<div class="outline-text-5" id="text-org5b739a6">
</div>
<ul class="org-ul">
<li><a id="org7cfe208"></a>Stage 1: Setup/Initialization<br /></li>
<li><a id="org32aa417"></a>Stage 2: <span class="underline"><span class="underline"><span class="underline">_</span></span></span><br /></li>
<li><a id="orgf7c8365"></a>Stage 3: Exploitation<br /></li>
<li><a id="org0544b6f"></a>Stage 4: Recovery / Cleanup ?<br /></li>
</ul>
</div>
</div>


<div id="outline-container-orgababb51" class="outline-4">
<h4 id="orgababb51">Common C Exploit types</h4>
<div class="outline-text-4" id="text-orgababb51">
<ul class="org-ul">
<li>Signedness issues
<a href="https://en.wikibooks.org/wiki/X86_Assembly/Control_Flow#Jump_if_Above_.28unsigned_comparison.29">https://en.wikibooks.org/wiki/X86_Assembly/Control_Flow#Jump_if_Above_.28unsigned_comparison.29</a></li>
<li>Integer overflow</li>
<li>Type promotion in comparison.</li>
<li>Overflowing into adjacent objects</li>
<li>Off-by-[one/X]</li>
<li>Use after free</li>
<li>Stack corruption</li>
<li>Heap Corruption</li>
<li>Information leak
Used to generate offsets to find task<sub>struct</sub> and set uid / gid to 0.</li>
<li>OOB accesss ?</li>
</ul>
</div>
</div>

<div id="outline-container-orgae00db3" class="outline-4">
<h4 id="orgae00db3">Kernel Mitigations</h4>
<div class="outline-text-4" id="text-orgae00db3">
<p>
Describe each one of the kernel mitigatations.
</p>
</div>

<div id="outline-container-orgcff5079" class="outline-5">
<h5 id="orgcff5079">Stack guard page.</h5>
</div>

<div id="outline-container-org87dbff8" class="outline-5">
<h5 id="org87dbff8">SMEP</h5>
<div class="outline-text-5" id="text-org87dbff8">
<p>
Bypassing SMEP (Supervisor Mode Execution Protection)
:- <a href="http://vulnfactory.org/blog/2011/06/05/smep-what-is-it-and-how-to-beat-it-on-linux/">http://vulnfactory.org/blog/2011/06/05/smep-what-is-it-and-how-to-beat-it-on-linux/</a>
</p>
</div>
</div>

<div id="outline-container-orgfd45f49" class="outline-5">
<h5 id="orgfd45f49">SMAP</h5>
<div class="outline-text-5" id="text-orgfd45f49">
<ul class="org-ul">
<li><p>
<a href="https://github.com/wmealing/playground/tree/master/kernel-module-disable-smep">https://github.com/wmealing/playground/tree/master/kernel-module-disable-smep</a>
</p>

<p>
So, weird things, i think it gets re-enabled when copy<sub>to</sub><sub>user</sub> happens
(frequently), so maybe i need to work this into some kind of shellcode
that can be injected during the payload.  
</p>

<p>
The other option is that i need to continually run this by hooking it
into the re-enable code to ensure that it never gets disabled
</p>

<p>
LWN made a page on it <a href="https://lwn.net/Articles/517475/">https://lwn.net/Articles/517475/</a>
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orge3c8860" class="outline-5">
<h5 id="orge3c8860">STACKSLA&#x2026;. (grsec)</h5>
</div>
<div id="outline-container-org7164147" class="outline-5">
<h5 id="org7164147">Struct alignment.</h5>
</div>

<div id="outline-container-org3003bd4" class="outline-5">
<h5 id="org3003bd4">Hardening list ?</h5>
</div>

<div id="outline-container-org48f0489" class="outline-5">
<h5 id="org48f0489">Seccomp sandboxing</h5>
</div>
