index.org
**** address_limit checks

     Vitaly talks about it here https://www.youtube.com/watch?v=UFakJa3t8Ls&t=7s
    
     get_fs() and set_fs() set the thread_info's addr_limit which is checked
     when copying to and from userspace/kernel space, by tricking this out, 
     any application can have arbitrary read/write of kernel address space.

**** Probable mitigations can be destroyed with rowhammer exploits or the newer
     intel CPU flaws.

** Day +2 (Exploit toolchain)
*** Abusing arbitrary read/write

    Show how infoleak + write can end up with a user discovering the location
    of the task struct (then creds) then setting effective uid and gid.

***** TODO Create github example module that allows for 1 byte read  and  write.

*** Abusing function pointers

    Show how abusing arbitary writes and then calling a function pointer
    to controlled code can control EIP.

    Mitigations will prevent this from happening.

***** TODO create github example of module that allows for arb read/write and fn abuse.

*** Controlled memory 'corruption'

    Sometimes only writes are not controlled, but corrupting,
    how do we take advantage of that

**** TODO create example of writing 'something' to a location, then spinning on
    it... slab trashing ?

*** Simple Race conditions

    How do we abuse race conditions (show dirty cow ?)
** Day +3
*** Logical and hardware related bugs
**** CDROM infoleak ?
*** Kernel and hardware protection

    - Reference capcom simple example, and make it.
    - Show how to prepare example with protections disabled.
    - smep, smap, nx, what happens when each of them are triggered.

*** Bypassing protections

    -> Show shellcode how to disable CR3 (capcom_ko ?)

*** The future of kernel vulnerabilties
    * May be only logic bugs in the future
    - Verified/Trustworthy languages may make kernel exploitation harder.
    * Fortunately hardware manufacturers keep making unsafe hardware so ...

** Day +4 (Stuff that Doesn't fit )
*** Rootkits
    https://github.com/f0rb1dd3n/
**** Tricks:
***** Finding Offset in structs.
      In crash,(and maybe GDB, stolen from   https://youtu.be/UFakJa3t8Ls?t=2995)
   
      #+BEGIN_EXAMPLE
        x/x &((struct somestruct *)0x1000)->element
        0x1000 (Plus offset)
      #+END_EXAMPLE

***** Skipping over instructions to simulate requirements.

      #+BEGIN_EXAMPLE
      so
      #+END_EXAMPLE



*** Basic commit creds example:
 
    Privilege escalation
     : TODO: basic example for commit_creds(prepare_kernel_cred)

    Privilege escalation heuristics
     : Dont know
 
