index.html
<div id="outline-container-orgab39510" class="outline-5">
<h5 id="orgab39510">address<sub>limit</sub> checks</h5>
<div class="outline-text-5" id="text-orgab39510">
<p>
Vitaly talks about it here <a href="https://www.youtube.com/watch?v=UFakJa3t8Ls&amp;t=7s">https://www.youtube.com/watch?v=UFakJa3t8Ls&amp;t=7s</a>
</p>

<p>
get<sub>fs</sub>() and set<sub>fs</sub>() set the thread<sub>info</sub>'s addr<sub>limit</sub> which is checked
when copying to and from userspace/kernel space, by tricking this out, 
any application can have arbitrary read/write of kernel address space.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgaaf2ab9" class="outline-3">
<h3 id="orgaaf2ab9"><span class="section-number-3">2.3</span> Day +2 (Exploit toolchain)</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org90f4224" class="outline-4">
<h4 id="org90f4224">Abusing arbitrary read/write</h4>
<div class="outline-text-4" id="text-org90f4224">
<p>
Show how infoleak + write can end up with a user discovering the location
of the task struct (then creds) then setting effective uid and gid.
</p>
</div>

<ul class="org-ul">
<li><a id="org2e78adf"></a><span class="todo TODO">TODO</span> Create github example module that allows for 1 byte read  and  write.<br /></li>
</ul>
</div>

<div id="outline-container-org6896eb2" class="outline-4">
<h4 id="org6896eb2">Abusing function pointers</h4>
<div class="outline-text-4" id="text-org6896eb2">
<p>
Show how abusing arbitary writes and then calling a function pointer
to controlled code can control EIP.
</p>

<p>
Mitigations will prevent this from happening.
</p>
</div>

<ul class="org-ul">
<li><a id="org53342e6"></a><span class="todo TODO">TODO</span> create github example of module that allows for arb read/write and fn abuse.<br /></li>
</ul>
</div>

<div id="outline-container-org74e58bf" class="outline-4">
<h4 id="org74e58bf">Controlled memory 'corruption'</h4>
<div class="outline-text-4" id="text-org74e58bf">
<p>
Sometimes only writes are not controlled, but corrupting,
how do we take advantage of that
</p>
</div>

<div id="outline-container-orge063035" class="outline-5">
<h5 id="orge063035"><span class="todo TODO">TODO</span> create example of writing 'something' to a location, then spinning on</h5>
<div class="outline-text-5" id="text-orge063035">
<p>
it&#x2026; slab trashing ?
</p>
</div>
</div>
</div>

<div id="outline-container-org6a9cff7" class="outline-4">
<h4 id="org6a9cff7">Simple Race conditions</h4>
<div class="outline-text-4" id="text-org6a9cff7">
<p>
How do we abuse race conditions (show dirty cow ?)
</p>
</div>
</div>
</div>
<div id="outline-container-orgf818e0f" class="outline-3">
<h3 id="orgf818e0f"><span class="section-number-3">2.4</span> Day +3</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org88b5c6f" class="outline-4">
<h4 id="org88b5c6f">Logical and hardware related bugs</h4>
</div>
<div id="outline-container-org6150900" class="outline-4">
<h4 id="org6150900">Kernel and hardware protection</h4>
<div class="outline-text-4" id="text-org6150900">
<ul class="org-ul">
<li>Reference capcom simple example, and make it.</li>
<li>Show how to prepare example with protections disabled.</li>
<li>smep, smap, nx, what happens when each of them are triggered.</li>
</ul>
</div>
</div>

<div id="outline-container-org368f37c" class="outline-4">
<h4 id="org368f37c">Bypassing protections</h4>
<div class="outline-text-4" id="text-org368f37c">
<p>
-&gt; Show shellcode how to disable CR3.
</p>
</div>
</div>


<div id="outline-container-orgf38e54f" class="outline-4">
<h4 id="orgf38e54f">The future of kernel vulnerabilties</h4>
<div class="outline-text-4" id="text-orgf38e54f">
<ul class="org-ul">
<li>Only logic ? Damn kernel hardening efforts ?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org425ac63" class="outline-3">
<h3 id="org425ac63"><span class="section-number-3">2.5</span> Day +4 (Stuff that Doesn't fit )</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-orgc7e0019" class="outline-4">
<h4 id="orgc7e0019">Rootkits</h4>
<div class="outline-text-4" id="text-orgc7e0019">
<p>
<a href="https://github.com/f0rb1dd3n/">https://github.com/f0rb1dd3n/</a>
</p>
</div>
<div id="outline-container-org2276428" class="outline-5">
<h5 id="org2276428">Tricks:</h5>
<div class="outline-text-5" id="text-org2276428">
</div>
<ul class="org-ul">
<li><a id="orgec29b73"></a>Finding Offset in structs.<br />
<div class="outline-text-6" id="text-orgec29b73">
<p>
In crash,(and maybe GDB, stolen from   <a href="https://youtu.be/UFakJa3t8Ls?t=2995">https://youtu.be/UFakJa3t8Ls?t=2995</a>)
</p>

<pre class="example">
x/x &amp;((struct somestruct *)0x1000)-&gt;element
0x1000 (Plus offset)
</pre>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf2997e5" class="outline-4">
<h4 id="orgf2997e5">Basic commit creds example:</h4>
<div class="outline-text-4" id="text-orgf2997e5">
<p>
Privilege escalation
</p>
<pre class="example">
TODO: basic example for commit_creds(prepare_kernel_cred)

</pre>

<p>
Privilege escalation heuristics
</p>
<pre class="example">
Dont know

</pre>
</div>
</div>
</div>
