index.org
** References / to sort.

  - android kernel exploitation playground
   :-  https://github.com/Fuzion24/AndroidKernelExploitationPlayground

  - Great link on linux kernel exploitation 
   :-  https://github.com/xairy/linux-kernel-exploitation

  * Vitaly's presentation on exploit generation stuff.
   :- https://www.youtube.com/watch?v=UFakJa3t8Ls&t=7s

  * - Simple exploit 
    :- ret2usr - https://github.com/vnik5287/kernel_rop/
    :- The advanced return-into-lib(c) exploits: PaX case study ( http://phrack.org/archives/issues/58/4.txt )

  * - Introduction to ret2usr attacks
   :- https://cyseclabs.com/slides/smep_bypass.pdf

  * - Exploiting kernel heap and stack vulnerabilities
   :- https://cyseclabs.com/blog/cve-2016-6187-heap-off-by-one-exploit

  * - Reliable exploitation of use-after-free (UAF) vulnerabilities
   :- http://perception-point.io/2016/01/14/analysis-and-exploitation-of-a-linux-kernel-vulnerability-cve-2016-0728/
   :- https://cyseclabs.com/page?n=02012016

  * Reliable UAF exploitation on SMP systems
   :- dont know how to do this, other than userfault fd maybe ?

  *  Why and Introduction to ret2dir attacks
   :- https://www.blackhat.com/docs/eu-14/materials/eu-14-Kemerlis-Ret2dir-Deconstructing-Kernel-Isolation-wp.pdf
   :- https://www.youtube.com/watch?v=kot-EQ9zf9k

  * Introduction to ROP
   :- https://www.trustwave.com/Resources/SpiderLabs-Blog/Linux-Kernel-ROP---Ropping-your-way-to---(Part-1)/
   :- https://www.trustwave.com/Resources/SpiderLabs-Blog/Linux-Kernel-ROP---Ropping-your-way-to---(Part-2)/
   :- 64-bit Linux Return-Oriented Programming ( http://crypto.stanford.edu/~blynn/rop/ )

  * Bypassing SMEP (Supervisor Mode Execution Protection)
   :- http://vulnfactory.org/blog/2011/06/05/smep-what-is-it-and-how-to-beat-it-on-linux/

  * IDT (Interrupt Descriptor Table) overwrites
   :- Is this still a thing ? http://phrack.org/issues/59/4.html


 (TO ADD/SORT)

 Linux Kernel Heap Tampering Detection ( http://phrack.org/archives/issues/66/15.txt )
 Automatic Bug-finding Techniques for Linux Kernel ( http://www.fi.muni.cz/~xslaby/sklad/teze.pdf )
 Vulnerability Extrapolation: Assisted Discovery of Vulnerabilities Using Machine Learning ( https://www.usenix.org/legacy/events/woot11/tech/final_files/Yamaguchi.pdf )
 Offset2lib: bypassing full ASLR on 64bit Linux ( http://cybersecurity.upv.es/attacks/offset2lib/offset2lib.html )
 Defeating Solar Designer’s Non-executable Stack Patch Summary ( http://insecure.org/sploits/non-executable.stack.problems.html )
 Introduction to return oriented programming (ROP) ( http://codearcana.com/posts/2013/05/28/introduction-to-return-oriented-programming-rop.html )

 - Need to know:
   http://stackoverflow.com/questions/2535989/what-are-the-calling-conventions-for-unix-linux-system-calls-on-x86-64
   Intel® 64 and IA-32 Architectures Software Developer Manuals ( http://www.intel.com/content/www/us/en/processors/architectures-software-developer-manuals.html )
 
 – Module debugging
  : loading a module in gdb ( https://github.com/vnik5287/kernel_rop/ )
  : stepping through  / breakpoints

  - Vitals talk on youtube. need to watch that again.
   

