index.html

<div id="outline-container-orgac0734e" class="outline-3">
<h3 id="orgac0734e"><span class="section-number-3">2.6</span> References / to sort.</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>android kernel exploitation playground
:-  <a href="https://github.com/Fuzion24/AndroidKernelExploitationPlayground">https://github.com/Fuzion24/AndroidKernelExploitationPlayground</a></li>

<li>Great link on linux kernel exploitation 
:-  <a href="https://github.com/xairy/linux-kernel-exploitation">https://github.com/xairy/linux-kernel-exploitation</a></li>

<li>Vitaly's presentation on exploit generation stuff.
:- <a href="https://www.youtube.com/watch?v=UFakJa3t8Ls&amp;t=7s">https://www.youtube.com/watch?v=UFakJa3t8Ls&amp;t=7s</a></li>

<li>- Simple exploit 
:- ret2usr - <a href="https://github.com/vnik5287/kernel_rop/">https://github.com/vnik5287/kernel_rop/</a>
:- The advanced return-into-lib(c) exploits: PaX case study ( <a href="http://phrack.org/archives/issues/58/4.txt">http://phrack.org/archives/issues/58/4.txt</a> )</li>

<li>- Introduction to ret2usr attacks
:- <a href="https://cyseclabs.com/slides/smep_bypass.pdf">https://cyseclabs.com/slides/smep_bypass.pdf</a></li>

<li>- Exploiting kernel heap and stack vulnerabilities
:- <a href="https://cyseclabs.com/blog/cve-2016-6187-heap-off-by-one-exploit">https://cyseclabs.com/blog/cve-2016-6187-heap-off-by-one-exploit</a></li>

<li>- Reliable exploitation of use-after-free (UAF) vulnerabilities
:- <a href="http://perception-point.io/2016/01/14/analysis-and-exploitation-of-a-linux-kernel-vulnerability-cve-2016-0728/">http://perception-point.io/2016/01/14/analysis-and-exploitation-of-a-linux-kernel-vulnerability-cve-2016-0728/</a>
:- <a href="https://cyseclabs.com/page?n=02012016">https://cyseclabs.com/page?n=02012016</a></li>

<li>Reliable UAF exploitation on SMP systems
:- dont know how to do this, other than userfault fd maybe ?</li>

<li>Why and Introduction to ret2dir attacks
:- <a href="https://www.blackhat.com/docs/eu-14/materials/eu-14-Kemerlis-Ret2dir-Deconstructing-Kernel-Isolation-wp.pdf">https://www.blackhat.com/docs/eu-14/materials/eu-14-Kemerlis-Ret2dir-Deconstructing-Kernel-Isolation-wp.pdf</a>
:- <a href="https://www.youtube.com/watch?v=kot-EQ9zf9k">https://www.youtube.com/watch?v=kot-EQ9zf9k</a></li>

<li>Introduction to ROP
:- <a href="https://www.trustwave.com/Resources/SpiderLabs-Blog/Linux-Kernel-ROP---Ropping-your-way-to">https://www.trustwave.com/Resources/SpiderLabs-Blog/Linux-Kernel-ROP---Ropping-your-way-to</a>&#x2014;(Part-1)/
:- <a href="https://www.trustwave.com/Resources/SpiderLabs-Blog/Linux-Kernel-ROP---Ropping-your-way-to">https://www.trustwave.com/Resources/SpiderLabs-Blog/Linux-Kernel-ROP---Ropping-your-way-to</a>&#x2014;(Part-2)/
:- 64-bit Linux Return-Oriented Programming ( <a href="http://crypto.stanford.edu/~blynn/rop/">http://crypto.stanford.edu/~blynn/rop/</a> )</li>

<li>Bypassing SMEP (Supervisor Mode Execution Protection)
:- <a href="http://vulnfactory.org/blog/2011/06/05/smep-what-is-it-and-how-to-beat-it-on-linux/">http://vulnfactory.org/blog/2011/06/05/smep-what-is-it-and-how-to-beat-it-on-linux/</a></li>

<li>IDT (Interrupt Descriptor Table) overwrites
:- Is this still a thing ? <a href="http://phrack.org/issues/59/4.html">http://phrack.org/issues/59/4.html</a></li>
</ul>


<p>
(TO ADD/SORT)
</p>

<p>
Linux Kernel Heap Tampering Detection ( <a href="http://phrack.org/archives/issues/66/15.txt">http://phrack.org/archives/issues/66/15.txt</a> )
Automatic Bug-finding Techniques for Linux Kernel ( <a href="http://www.fi.muni.cz/~xslaby/sklad/teze.pdf">http://www.fi.muni.cz/~xslaby/sklad/teze.pdf</a> )
Vulnerability Extrapolation: Assisted Discovery of Vulnerabilities Using Machine Learning ( <a href="https://www.usenix.org/legacy/events/woot11/tech/final_files/Yamaguchi.pdf">https://www.usenix.org/legacy/events/woot11/tech/final_files/Yamaguchi.pdf</a> )
Offset2lib: bypassing full ASLR on 64bit Linux ( <a href="http://cybersecurity.upv.es/attacks/offset2lib/offset2lib.html">http://cybersecurity.upv.es/attacks/offset2lib/offset2lib.html</a> )
Defeating Solar Designer’s Non-executable Stack Patch Summary ( <a href="http://insecure.org/sploits/non-executable.stack.problems.html">http://insecure.org/sploits/non-executable.stack.problems.html</a> )
Introduction to return oriented programming (ROP) ( <a href="http://codearcana.com/posts/2013/05/28/introduction-to-return-oriented-programming-rop.html">http://codearcana.com/posts/2013/05/28/introduction-to-return-oriented-programming-rop.html</a> )
</p>

<ul class="org-ul">
<li>Need to know:
<a href="http://stackoverflow.com/questions/2535989/what-are-the-calling-conventions-for-unix-linux-system-calls-on-x86-64">http://stackoverflow.com/questions/2535989/what-are-the-calling-conventions-for-unix-linux-system-calls-on-x86-64</a>
Intel® 64 and IA-32 Architectures Software Developer Manuals ( <a href="http://www.intel.com/content/www/us/en/processors/architectures-software-developer-manuals.html">http://www.intel.com/content/www/us/en/processors/architectures-software-developer-manuals.html</a> )</li>
</ul>

<p>
– Module debugging
</p>
<pre class="example">
loading a module in gdb ( https://github.com/vnik5287/kernel_rop/ )
stepping through  / breakpoints

</pre>

<ul class="org-ul">
<li>Vitals talk on youtube. need to watch that again.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 0F04</p>
<p class="date">Created: 2018-06-04 Mon 16:42</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
